#include <iostream>
#include <vector>
#include <math.h>

using namespace std;

long long dp[1000002];

int main()
{
    long long n;
    
    cin>>n;

    dp[1]= 1;
    dp[2] = 2;
    dp[3] = 2;
    
    dp[4] = 4;
    dp[5] = 4;
    
    dp[6] = 6;
    dp[7] = 6;
    
    dp[8] = 10;
    dp[9] = 10;
    
    dp[10] = 14;
    dp[11] = 14;
    
    dp[12] = 20;
    dp[13] = 20;
    
    dp[14] = 26;
    dp[15] = 26;

    
    for (int i = 16; i <=n; i++)
    {
        if (i % 2 == 1)
        {
            dp[i] = dp[i-1];
        }
        else
        {
            dp[i] = (dp[i-2] + dp[i/2]) % 1000000000;
        }
    }
    cout<<dp[n];
/*    
    111111  11  11  11  11
    11 2 2  11  11  11  11
    11 4    11  11  11  11
    1111 2  11  11  11  11
    2 2 2   11  11  11  11
    2 4     11  11  11  11
    2 2 2 2     11  11  11
    2 2 4       11  11  11
    4 4         11  11  11
    8           11  11  11
    2 2 2 2 2       11  11
    2 2 2 4         11  11
    2 4 4           11  11
    2 8             11  11
    2 2 2 2 2 2         11
    2 2 2 2 4           11
    2 2 4 4             11
    4 4 4               11
    2 2 8               11
    4 8                 11
    2 2 2 2 2 2 2
    2 2 2 2 2 4
    2 2 2 4 4
    2 4 4 4
    2 2 2 8
    2 4 8
    */

    //2로 나눠 떨어지면, 
    //홀수면 그냥 하나작은 짝수랑 같고,     
    //2 몇개로 표현되는지 구한다면, 

    return 0;
}